app/controllers/scorm_file_controller.rb

  def create
    @scorm_file = ScormFile.new(params[:scorm_file])
    @scorm_file.save!
---
INSERT INTO "scorm_files" ("avatar_url", "created_at", "description", "name", "source_content_type", "source_file_name", "source_file_size", "source_updated_at", "sourcer_content_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)